# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [49]:
import pandas as pd
import numpy as np

In [21]:
ds1= pd.Series([2, 4, 6, 8, 10])
ds2= pd.Series([1, 3, 5, 7, 9])
print("Addition (ds1+ds2):\n", ds1+ds2)
print("Substraction (ds1-ds2):\n", ds1-ds2)
print("Division (ds1/ds2):\n", ds1/ds2)
print("Multiplication (ds1*ds2):\n", ds1*ds2)

Addition (ds1+ds2):
 0     3
1     7
2    11
3    15
4    19
dtype: int64
Substraction (ds1-ds2):
 0    1
1    1
2    1
3    1
4    1
dtype: int64
Division (ds1/ds2):
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64
Multiplication (ds1*ds2):
 0     2
1    12
2    30
3    56
4    90
dtype: int64

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [24]:
my_dict={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
ds=pd.Series(my_dict)
print('Pandas series is\n',ds)

Pandas series is
 a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [34]:
ds=pd.Series({'0': 100,'1':200,'2':'python',"3": 300.12,'4': 400})
ds2 = pd.to_numeric(ds, errors='coerce')
print('Original Series:\n', ds)
print('\nSeries with modified datatype:\n', ds2)

Original Series:
 0       100
1       200
2    python
3    300.12
4       400
dtype: object

Series with modified datatype:
 0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [42]:
df=pd.DataFrame({'col1':[1,2,3,4,7,11],'col2':[4,5,6,9,5,0],'col3':[7,5,8,12,1,11]})
ds=pd.Series(df['col1'])
print(ds)
type(ds)

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

pandas.core.series.Series

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [46]:
ds=pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print('Data Series:\n', ds)
print('Mean of the series:',ds.mean())
print('Standard deviation of the series:',ds.std())

Data Series:
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64
Mean of the series: 4.818181818181818
Standard deviation of the series: 2.522624895547565

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [48]:
#The Question is not clear or complete
df=pd.DataFrame({'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]})
df

   X    Y    Z
0  78   84  86
1  85   94  97
2  96   89  96
3  80   83  72
4  86   86  83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [76]:
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df=pd.DataFrame(data , index=labels)
print('First three rows of the data frame')
df.iloc[:3]

First three rows of the data frame

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [88]:
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df=pd.DataFrame(data , index=labels)

print(df.iloc[[1, 3, 5, 6],[0,1]])

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [96]:
# IT IS NOT POSSIBLE TO CALCULATE MEAN OF EACH STUDENT AS THERE ARE NO MULTIPLE SCORE FOR EACH STUDENTS
# THEREFOR MEAN OF SCORE IS COMPUTED
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df=pd.DataFrame(data , index=labels)

print('Mean of the score column is:',df['score'].mean())

Mean of the score column is: 13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [100]:
df=pd.DataFrame({'col1':[0,1,2],'col2':[1,2,3],'col3':[4,5,6],'col4':[7,8,9]})
print('Original dataframe:\n', df)
df.columns=['column1','column2','column3','column4']
print('Dataframe with columns renamed:\n', df)

Original dataframe:
    col1  col2  col3  col4
0     0     1     4     7
1     1     2     5     8
2     2     3     6     9
Dataframe with columns renamed:
    column1  column2  column3  column4
0        0        1        4        7
1        1        2        5        8
2        2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [111]:
#CITY, NAME OF THE PERSON DATA SET IS NOT SUPPLIED IT IS ASSUMED
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'city': ['California', 'Georgia', 'California', 'California', 'Georgia', 'Los Angeles', 'Los Angeles', 'California', 'Los Angeles', 'Los Angeles']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df=pd.DataFrame(data , index=labels)
df.groupby(['city']).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [131]:
df=pd.DataFrame({'col1':[0,1,2,3,4,],'col2':[1,4,3,4,5],'col3':[7,8,9,0,1]})
print('Original dataframe:\n', df)
pd.set_option('display.max_column',100)
pd.set_option('display.max_row',100)
pd.set_option('display.width',100)

Original dataframe:
    col1  col2  col3
0     0     1     7
1     1     4     8
2     2     3     9
3     3     4     0
4     4     5     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [138]:
ds=pd.Series(['3/11/2000','3/12/2000','3/13/2000'])
print('column with string date:\n', ds)
df=pd.to_datetime(ds)
print('\ncolumn with date:\n', df)

column with string date:
 0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

column with date:
 0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [152]:
df=pd.DataFrame()
print('Empty df:',df)
data=pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6]})
df=df.append(data)
print('Appended df:\n',df)

Empty df: Empty DataFrame
Columns: []
Index: []
Appended df:
    col1  col2
0     1     4
1     2     5
2     3     6

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [160]:
df=pd.DataFrame({'col1':[0,1,2,3,4,],'col2':[1,4,3,4,5],'col3':[7,8,9,0,1]})
print('Original dataframe:\n', df)
print('\nNumber of columns',len(df.columns))

Original dataframe:
    col1  col2  col3
0     0     1     7
1     1     4     8
2     2     3     9
3     3     4     0
4     4     5     1

Number of columns 3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [168]:
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
print('Original df\n',df)
print('\nAfter removing last 3 rows\n',df.iloc[:3])

Original df
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

After removing last 3 rows
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [172]:
df=pd.read_excel('/home/murali/ds/data/coalpublic2013.xlsx')
df.head()

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [174]:
df=pd.read_excel('/home/murali/ds/data/coalpublic2013.xlsx')
df[df["Mine_Name"].map(lambda d: d.startswith('P'))]

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [182]:
df=pd.read_excel('/home/murali/ds/data/employee.xlsx')
df[df["hire_date"]>'20070101']

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [197]:
df=pd.read_excel('/home/murali/ds/data/employee.xlsx')
df1=df.set_index(["hire_date"])
df1["2005"]

            emp_id first_name last_name
hire_date
2005-09-21     101      Neena   Kochhar
2005-06-25     105      David    Austin
2005-09-28     110       John      Chen
2005-09-30     111     Ismael   Sciarra
2005-12-24     116     Shelli     Baida
2005-07-24     117      Sigal    Tobias

## Great Job!